ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_STM/TARGET_STM32F4/serial_api.c
    obj->tx_buff.buffer = 0;
    obj->tx_buff.length = 0;
  
}

/** Abort the ongoing RX transaction It disables the enabled interrupt for RX and
 *  flush RX hardware buffer if RX FIFO is used
 *
 * @param obj The serial object
 */
void serial_rx_abort_asynch(serial_t *obj) {

    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));
    __HAL_UART_DISABLE_IT(&UartHandle, UART_IT_RXNE);
    UartHandle.Instance = 0;
  
    obj->rx_buff.buffer = 0;
    obj->rx_buff.length = 0;

}

#endif

#if DEVICE_SERIAL_FC
/** Set HW Control Flow
 * @param obj    The serial object
 * @param type   The Control Flow type (FlowControlNone, FlowControlRTS, FlowControlCTS, FlowControlRTSCTS)
 * @param rxflow Pin for the rxflow
 * @param txflow Pin for the txflow
 */
void serial_set_flow_control(serial_t *obj, FlowControl type, PinName rxflow, PinName txflow)
{

    // Determine the UART to use (UART_1, UART_2, ...)
    UARTName uart_rts = (UARTName)pinmap_peripheral(rxflow, PinMap_UART_RTS);
    UARTName uart_cts = (UARTName)pinmap_peripheral(txflow, PinMap_UART_CTS);

    // Get the peripheral name (UART_1, UART_2, ...) from the pin and assign it to the object
    _SERIAL_OBJ(uart) = (UARTName)pinmap_merge(uart_cts, uart_rts);

    MBED_ASSERT(_SERIAL_OBJ(uart) != (UARTName)NC);
    UartHandle.Instance = (USART_TypeDef *)(_SERIAL_OBJ(uart));

    if(type == FlowControlNone) {
        // Disable hardware flow control
      _SERIAL_OBJ(hw_flow_ctl) = UART_HWCONTROL_NONE;
      UartHandle.Instance->CR3 &= ~UART_HWCONTROL_RTS_CTS;
    }
    if (type == FlowControlRTS) {
        // Enable RTS
        MBED_ASSERT(uart_rts != (UARTName)NC);
        _SERIAL_OBJ(hw_flow_ctl) = UART_HWCONTROL_RTS;
        // Enable the pin for RTS function
        pinmap_pinout(rxflow, PinMap_UART_RTS);
        UartHandle.Instance->CR3 |= UART_HWCONTROL_RTS;
    }
    if (type == FlowControlCTS) {
        // Enable CTS
        MBED_ASSERT(uart_cts != (UARTName)NC);
        _SERIAL_OBJ(hw_flow_ctl) = UART_HWCONTROL_CTS;
        // Enable the pin for CTS function
        pinmap_pinout(txflow, PinMap_UART_CTS);
        UartHandle.Instance->CR3 |= UART_HWCONTROL_CTS;
    }
    if (type == FlowControlRTSCTS) {
        // Enable CTS & RTS
        MBED_ASSERT(uart_rts != (UARTName)NC);
        MBED_ASSERT(uart_cts != (UARTName)NC);
        _SERIAL_OBJ(hw_flow_ctl) = UART_HWCONTROL_RTS_CTS;
        // Enable the pin for CTS function
        pinmap_pinout(txflow, PinMap_UART_CTS);
        // Enable the pin for RTS function
        pinmap_pinout(rxflow, PinMap_UART_RTS);
        UartHandle.Instance->CR3 |= UART_HWCONTROL_RTS_CTS;
    }
}
#endif
#endif
